import pandas as pd

# Создание DataFrame
data = {
    '№': [1, 2, 3, 4, 5],
    'Номенклатура': [
        '[AR, 03879, 0,8*1,5, ST, BLUE,BLUE]',
        '[AR, 03880, 0,8*1,5, ST, BLUE,BLUE]',
        '[AR, 03880, 1,6*2,3, ST, BLUE,BLUE]',
        '[AR, 03880, 1,6*1,6, KG, BROWN,BROWN]',
        '[AT, D733, 1,6*2,2, ST, CREAM]'
    ],
    'Ширина': [1.0, 0.8, 1.6, 1.6, 1.66],
    'Длина': [2.0, 1.5, 2.3, 1.6, 2.22],
    'Количество, шт': [1.0, 1.0, 1.0, 1.0, 1.0],
    'Количество, м2': [1.2, 1.2, 3.68, 2.56, 3.52],
    'Масса КГ.': [2.82, 2.82, 8.65, 6.02, 7.16],
    'Штрихкод': [8680142315860, 8680142281066, 8680142281059, 8680142460102, 4680343266057],
    'Цена': [1366.0, 1366.0, 1366.0, 1366.0, 955.0],
    'Цена со скидкой': [1366.0, 1366.0, 1366.0, 1366.0, 955.0],
    'Сумма': [1639.20, 1639.20, 5026.88, 3496.96, 3361.60]
}

df = pd.DataFrame(data)

# Функция для обновления элемента в массиве
def update_nomenclature(row):
    nomenclature = row['Номенклатура'].strip('[]').split(', ')
    width_length = f"{str(row['Ширина']).replace('.', '')}{str(row['Длина']).replace('.', '')}"
    nomenclature[2] = width_length
    return f"[{', '.join(nomenclature)}]"

# Применение функции к DataFrame
df['Номенклатура'] = df.apply(update_nomenclature, axis=1)

print(df)
